In [29]:
import pandas as pd

valueslist = [3,5,6,7,9]
a_series = pd.Series(valueslist, dtype=int, name='values_int')
a_series

0    3
1    5
2    6
3    7
4    9
Name: values_int, dtype: int64

In [30]:
valueslist2 = [4,5,7,10,12,13]
b_series = pd.Series(valueslist2,  name= 'values_float')
b_series

0     4
1     5
2     7
3    10
4    12
5    13
Name: values_float, dtype: int64

In [31]:
df = pd.DataFrame({"a":a_series,"b": b_series})
df

     a   b
0  3.0   4
1  5.0   5
2  6.0   7
3  7.0  10
4  9.0  12
5  NaN  13

In [34]:
pd.concat([a_series, b_series],axis=1)

   values_int  values_float
0         3.0             4
1         5.0             5
2         6.0             7
3         7.0            10
4         9.0            12
5         NaN            13